Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/bootloader/firmware/src/packs/PIC32WM_BZ6204_DFP/component/pac.h
#define PAC_INTFLAGAHB_SRAM_Pos               _UINT32_(0)                                          /* (PAC_INTFLAGAHB Position) SRAMx */
#define PAC_INTFLAGAHB_SRAM_Msk               (_UINT32_(0xF) << PAC_INTFLAGAHB_SRAM_Pos)           /* (PAC_INTFLAGAHB Mask) SRAM */
#define PAC_INTFLAGAHB_SRAM(value)            (PAC_INTFLAGAHB_SRAM_Msk & (_UINT32_(value) << PAC_INTFLAGAHB_SRAM_Pos)) 

/* -------- PAC_INTFLAGA : (PAC Offset: 0x14) (R/W 32) Peripheral interrupt flag status - Bridge A -------- */
#define PAC_INTFLAGA_RESETVALUE               _UINT32_(0x00)                                       /*  (PAC_INTFLAGA) Peripheral interrupt flag status - Bridge A  Reset Value */

#define PAC_INTFLAGA_PAC_Pos                  _UINT32_(0)                                          /* (PAC_INTFLAGA) PAC Position */
#define PAC_INTFLAGA_PAC_Msk                  (_UINT32_(0x1) << PAC_INTFLAGA_PAC_Pos)              /* (PAC_INTFLAGA) PAC Mask */
#define PAC_INTFLAGA_PAC(value)               (PAC_INTFLAGA_PAC_Msk & (_UINT32_(value) << PAC_INTFLAGA_PAC_Pos)) /* Assignment of value for PAC in the PAC_INTFLAGA register */
#define PAC_INTFLAGA_FREQM_Pos                _UINT32_(1)                                          /* (PAC_INTFLAGA) FREQM Position */
#define PAC_INTFLAGA_FREQM_Msk                (_UINT32_(0x1) << PAC_INTFLAGA_FREQM_Pos)            /* (PAC_INTFLAGA) FREQM Mask */
#define PAC_INTFLAGA_FREQM(value)             (PAC_INTFLAGA_FREQM_Msk & (_UINT32_(value) << PAC_INTFLAGA_FREQM_Pos)) /* Assignment of value for FREQM in the PAC_INTFLAGA register */
#define PAC_INTFLAGA_EIC_Pos                  _UINT32_(2)                                          /* (PAC_INTFLAGA) EIC Position */
#define PAC_INTFLAGA_EIC_Msk                  (_UINT32_(0x1) << PAC_INTFLAGA_EIC_Pos)              /* (PAC_INTFLAGA) EIC Mask */
#define PAC_INTFLAGA_EIC(value)               (PAC_INTFLAGA_EIC_Msk & (_UINT32_(value) << PAC_INTFLAGA_EIC_Pos)) /* Assignment of value for EIC in the PAC_INTFLAGA register */
#define PAC_INTFLAGA_SERCOM0_Pos              _UINT32_(3)                                          /* (PAC_INTFLAGA) SERCOM0 Position */
#define PAC_INTFLAGA_SERCOM0_Msk              (_UINT32_(0x1) << PAC_INTFLAGA_SERCOM0_Pos)          /* (PAC_INTFLAGA) SERCOM0 Mask */
#define PAC_INTFLAGA_SERCOM0(value)           (PAC_INTFLAGA_SERCOM0_Msk & (_UINT32_(value) << PAC_INTFLAGA_SERCOM0_Pos)) /* Assignment of value for SERCOM0 in the PAC_INTFLAGA register */
#define PAC_INTFLAGA_SERCOM1_Pos              _UINT32_(4)                                          /* (PAC_INTFLAGA) SERCOM1 Position */
#define PAC_INTFLAGA_SERCOM1_Msk              (_UINT32_(0x1) << PAC_INTFLAGA_SERCOM1_Pos)          /* (PAC_INTFLAGA) SERCOM1 Mask */
#define PAC_INTFLAGA_SERCOM1(value)           (PAC_INTFLAGA_SERCOM1_Msk & (_UINT32_(value) << PAC_INTFLAGA_SERCOM1_Pos)) /* Assignment of value for SERCOM1 in the PAC_INTFLAGA register */
#define PAC_INTFLAGA_TC0_Pos                  _UINT32_(5)                                          /* (PAC_INTFLAGA) TC0 Position */
#define PAC_INTFLAGA_TC0_Msk                  (_UINT32_(0x1) << PAC_INTFLAGA_TC0_Pos)              /* (PAC_INTFLAGA) TC0 Mask */
#define PAC_INTFLAGA_TC0(value)               (PAC_INTFLAGA_TC0_Msk & (_UINT32_(value) << PAC_INTFLAGA_TC0_Pos)) /* Assignment of value for TC0 in the PAC_INTFLAGA register */
#define PAC_INTFLAGA_TC1_Pos                  _UINT32_(6)                                          /* (PAC_INTFLAGA) TC1 Position */
#define PAC_INTFLAGA_TC1_Msk                  (_UINT32_(0x1) << PAC_INTFLAGA_TC1_Pos)              /* (PAC_INTFLAGA) TC1 Mask */
#define PAC_INTFLAGA_TC1(value)               (PAC_INTFLAGA_TC1_Msk & (_UINT32_(value) << PAC_INTFLAGA_TC1_Pos)) /* Assignment of value for TC1 in the PAC_INTFLAGA register */
#define PAC_INTFLAGA_TC2_Pos                  _UINT32_(7)                                          /* (PAC_INTFLAGA) TC2 Position */
#define PAC_INTFLAGA_TC2_Msk                  (_UINT32_(0x1) << PAC_INTFLAGA_TC2_Pos)              /* (PAC_INTFLAGA) TC2 Mask */
#define PAC_INTFLAGA_TC2(value)               (PAC_INTFLAGA_TC2_Msk & (_UINT32_(value) << PAC_INTFLAGA_TC2_Pos)) /* Assignment of value for TC2 in the PAC_INTFLAGA register */
#define PAC_INTFLAGA_TC3_Pos                  _UINT32_(8)                                          /* (PAC_INTFLAGA) TC3 Position */
#define PAC_INTFLAGA_TC3_Msk                  (_UINT32_(0x1) << PAC_INTFLAGA_TC3_Pos)              /* (PAC_INTFLAGA) TC3 Mask */
#define PAC_INTFLAGA_TC3(value)               (PAC_INTFLAGA_TC3_Msk & (_UINT32_(value) << PAC_INTFLAGA_TC3_Pos)) /* Assignment of value for TC3 in the PAC_INTFLAGA register */
#define PAC_INTFLAGA_TC4_Pos                  _UINT32_(9)                                          /* (PAC_INTFLAGA) TC4 Position */
#define PAC_INTFLAGA_TC4_Msk                  (_UINT32_(0x1) << PAC_INTFLAGA_TC4_Pos)              /* (PAC_INTFLAGA) TC4 Mask */
#define PAC_INTFLAGA_TC4(value)               (PAC_INTFLAGA_TC4_Msk & (_UINT32_(value) << PAC_INTFLAGA_TC4_Pos)) /* Assignment of value for TC4 in the PAC_INTFLAGA register */
#define PAC_INTFLAGA_TC5_Pos                  _UINT32_(10)                                         /* (PAC_INTFLAGA) TC5 Position */
#define PAC_INTFLAGA_TC5_Msk                  (_UINT32_(0x1) << PAC_INTFLAGA_TC5_Pos)              /* (PAC_INTFLAGA) TC5 Mask */
#define PAC_INTFLAGA_TC5(value)               (PAC_INTFLAGA_TC5_Msk & (_UINT32_(value) << PAC_INTFLAGA_TC5_Pos)) /* Assignment of value for TC5 in the PAC_INTFLAGA register */
#define PAC_INTFLAGA_TC6_Pos                  _UINT32_(11)                                         /* (PAC_INTFLAGA) TC6 Position */
#define PAC_INTFLAGA_TC6_Msk                  (_UINT32_(0x1) << PAC_INTFLAGA_TC6_Pos)              /* (PAC_INTFLAGA) TC6 Mask */
#define PAC_INTFLAGA_TC6(value)               (PAC_INTFLAGA_TC6_Msk & (_UINT32_(value) << PAC_INTFLAGA_TC6_Pos)) /* Assignment of value for TC6 in the PAC_INTFLAGA register */
#define PAC_INTFLAGA_TC7_Pos                  _UINT32_(12)                                         /* (PAC_INTFLAGA) TC7 Position */
#define PAC_INTFLAGA_TC7_Msk                  (_UINT32_(0x1) << PAC_INTFLAGA_TC7_Pos)              /* (PAC_INTFLAGA) TC7 Mask */
#define PAC_INTFLAGA_TC7(value)               (PAC_INTFLAGA_TC7_Msk & (_UINT32_(value) << PAC_INTFLAGA_TC7_Pos)) /* Assignment of value for TC7 in the PAC_INTFLAGA register */
#define PAC_INTFLAGA_TCC0_Pos                 _UINT32_(13)                                         /* (PAC_INTFLAGA) TCC0 Position */
#define PAC_INTFLAGA_TCC0_Msk                 (_UINT32_(0x1) << PAC_INTFLAGA_TCC0_Pos)             /* (PAC_INTFLAGA) TCC0 Mask */
#define PAC_INTFLAGA_TCC0(value)              (PAC_INTFLAGA_TCC0_Msk & (_UINT32_(value) << PAC_INTFLAGA_TCC0_Pos)) /* Assignment of value for TCC0 in the PAC_INTFLAGA register */
#define PAC_INTFLAGA_TCC1_Pos                 _UINT32_(14)                                         /* (PAC_INTFLAGA) TCC1 Position */
#define PAC_INTFLAGA_TCC1_Msk                 (_UINT32_(0x1) << PAC_INTFLAGA_TCC1_Pos)             /* (PAC_INTFLAGA) TCC1 Mask */
#define PAC_INTFLAGA_TCC1(value)              (PAC_INTFLAGA_TCC1_Msk & (_UINT32_(value) << PAC_INTFLAGA_TCC1_Pos)) /* Assignment of value for TCC1 in the PAC_INTFLAGA register */
#define PAC_INTFLAGA_TCC2_Pos                 _UINT32_(15)                                         /* (PAC_INTFLAGA) TCC2 Position */
#define PAC_INTFLAGA_TCC2_Msk                 (_UINT32_(0x1) << PAC_INTFLAGA_TCC2_Pos)             /* (PAC_INTFLAGA) TCC2 Mask */
#define PAC_INTFLAGA_TCC2(value)              (PAC_INTFLAGA_TCC2_Msk & (_UINT32_(value) << PAC_INTFLAGA_TCC2_Pos)) /* Assignment of value for TCC2 in the PAC_INTFLAGA register */
#define PAC_INTFLAGA_Msk                      _UINT32_(0x0000FFFF)                                 /* (PAC_INTFLAGA) Register Mask  */

#define PAC_INTFLAGA_SERCOM_Pos               _UINT32_(3)                                          /* (PAC_INTFLAGA Position) SERCOMx */
#define PAC_INTFLAGA_SERCOM_Msk               (_UINT32_(0x3) << PAC_INTFLAGA_SERCOM_Pos)           /* (PAC_INTFLAGA Mask) SERCOM */
#define PAC_INTFLAGA_SERCOM(value)            (PAC_INTFLAGA_SERCOM_Msk & (_UINT32_(value) << PAC_INTFLAGA_SERCOM_Pos)) 
#define PAC_INTFLAGA_TC_Pos                   _UINT32_(5)                                          /* (PAC_INTFLAGA Position) TCx */
#define PAC_INTFLAGA_TC_Msk                   (_UINT32_(0xFF) << PAC_INTFLAGA_TC_Pos)              /* (PAC_INTFLAGA Mask) TC */
#define PAC_INTFLAGA_TC(value)                (PAC_INTFLAGA_TC_Msk & (_UINT32_(value) << PAC_INTFLAGA_TC_Pos)) 
#define PAC_INTFLAGA_TCC_Pos                  _UINT32_(13)                                         /* (PAC_INTFLAGA Position) TCC2 */
#define PAC_INTFLAGA_TCC_Msk                  (_UINT32_(0x7) << PAC_INTFLAGA_TCC_Pos)              /* (PAC_INTFLAGA Mask) TCC */
#define PAC_INTFLAGA_TCC(value)               (PAC_INTFLAGA_TCC_Msk & (_UINT32_(value) << PAC_INTFLAGA_TCC_Pos)) 

/* -------- PAC_INTFLAGB : (PAC Offset: 0x18) (R/W 32) Peripheral interrupt flag status - Bridge B -------- */
#define PAC_INTFLAGB_RESETVALUE               _UINT32_(0x00)                                       /*  (PAC_INTFLAGB) Peripheral interrupt flag status - Bridge B  Reset Value */

#define PAC_INTFLAGB_DSU_Pos                  _UINT32_(0)                                          /* (PAC_INTFLAGB) DSU Position */
#define PAC_INTFLAGB_DSU_Msk                  (_UINT32_(0x1) << PAC_INTFLAGB_DSU_Pos)              /* (PAC_INTFLAGB) DSU Mask */
#define PAC_INTFLAGB_DSU(value)               (PAC_INTFLAGB_DSU_Msk & (_UINT32_(value) << PAC_INTFLAGB_DSU_Pos)) /* Assignment of value for DSU in the PAC_INTFLAGB register */
#define PAC_INTFLAGB_DMAC_Pos                 _UINT32_(2)                                          /* (PAC_INTFLAGB) DMAC Position */
#define PAC_INTFLAGB_DMAC_Msk                 (_UINT32_(0x1) << PAC_INTFLAGB_DMAC_Pos)             /* (PAC_INTFLAGB) DMAC Mask */
#define PAC_INTFLAGB_DMAC(value)              (PAC_INTFLAGB_DMAC_Msk & (_UINT32_(value) << PAC_INTFLAGB_DMAC_Pos)) /* Assignment of value for DMAC in the PAC_INTFLAGB register */
#define PAC_INTFLAGB_EVSYS_Pos                _UINT32_(3)                                          /* (PAC_INTFLAGB) EVSYS Position */
#define PAC_INTFLAGB_EVSYS_Msk                (_UINT32_(0x1) << PAC_INTFLAGB_EVSYS_Pos)            /* (PAC_INTFLAGB) EVSYS Mask */
#define PAC_INTFLAGB_EVSYS(value)             (PAC_INTFLAGB_EVSYS_Msk & (_UINT32_(value) << PAC_INTFLAGB_EVSYS_Pos)) /* Assignment of value for EVSYS in the PAC_INTFLAGB register */
#define PAC_INTFLAGB_RAMECC_Pos               _UINT32_(4)                                          /* (PAC_INTFLAGB) RAMECC Position */
#define PAC_INTFLAGB_RAMECC_Msk               (_UINT32_(0x1) << PAC_INTFLAGB_RAMECC_Pos)           /* (PAC_INTFLAGB) RAMECC Mask */
#define PAC_INTFLAGB_RAMECC(value)            (PAC_INTFLAGB_RAMECC_Msk & (_UINT32_(value) << PAC_INTFLAGB_RAMECC_Pos)) /* Assignment of value for RAMECC in the PAC_INTFLAGB register */
#define PAC_INTFLAGB_ETH_Pos                  _UINT32_(5)                                          /* (PAC_INTFLAGB) ETH Position */
#define PAC_INTFLAGB_ETH_Msk                  (_UINT32_(0x1) << PAC_INTFLAGB_ETH_Pos)              /* (PAC_INTFLAGB) ETH Mask */
#define PAC_INTFLAGB_ETH(value)               (PAC_INTFLAGB_ETH_Msk & (_UINT32_(value) << PAC_INTFLAGB_ETH_Pos)) /* Assignment of value for ETH in the PAC_INTFLAGB register */
#define PAC_INTFLAGB_Msk                      _UINT32_(0x0000003D)                                 /* (PAC_INTFLAGB) Register Mask  */


